In [1]:
import pandas as pd
import numpy as np

/tmp/ipykernel_24382/2162656668.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
date_list = pd.date_range("20130101", periods=6)
date_list

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4),
                  index=date_list,
                  columns=["A", "B", "C", "D"])
df

                   A         B         C         D
2013-01-01 -2.442195  0.371130 -0.149027  0.983568
2013-01-02  0.583029 -2.108220 -0.636579  0.659739
2013-01-03 -1.871060 -0.466960  0.799559  0.147385
2013-01-04 -0.942194 -0.596517 -1.060994  0.272827
2013-01-05  0.210414  3.137729  0.680962 -0.920845
2013-01-06 -0.930304  0.801157 -2.671204 -0.874440

In [5]:
df.head()

                   A         B         C         D
2013-01-01 -2.442195  0.371130 -0.149027  0.983568
2013-01-02  0.583029 -2.108220 -0.636579  0.659739
2013-01-03 -1.871060 -0.466960  0.799559  0.147385
2013-01-04 -0.942194 -0.596517 -1.060994  0.272827
2013-01-05  0.210414  3.137729  0.680962 -0.920845

In [6]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [8]:
df.values

array([[-2.44219536,  0.37112957, -0.14902736,  0.98356805],
       [ 0.58302931, -2.10822004, -0.63657903,  0.65973902],
       [-1.87105951, -0.46695979,  0.79955934,  0.14738471],
       [-0.94219366, -0.59651732, -1.06099366,  0.27282668],
       [ 0.21041448,  3.13772852,  0.68096161, -0.92084462],
       [-0.9303045 ,  0.80115735, -2.67120412, -0.87443975]])

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [10]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.898718  0.189720 -0.506214  0.044706
std    1.162446  1.756556  1.284832  0.787328
min   -2.442195 -2.108220 -2.671204 -0.920845
25%   -1.638843 -0.564128 -0.954890 -0.618984
50%   -0.936249 -0.047915 -0.392803  0.210106
75%   -0.074765  0.693650  0.473464  0.563011
max    0.583029  3.137729  0.799559  0.983568

In [11]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-05  0.210414  3.137729  0.680962 -0.920845
2013-01-06 -0.930304  0.801157 -2.671204 -0.874440
2013-01-01 -2.442195  0.371130 -0.149027  0.983568
2013-01-03 -1.871060 -0.466960  0.799559  0.147385
2013-01-04 -0.942194 -0.596517 -1.060994  0.272827
2013-01-02  0.583029 -2.108220 -0.636579  0.659739

In [12]:
df["A"]

2013-01-01   -2.442195
2013-01-02    0.583029
2013-01-03   -1.871060
2013-01-04   -0.942194
2013-01-05    0.210414
2013-01-06   -0.930304
Freq: D, Name: A, dtype: float64

In [13]:
df[0:3]

                   A        B         C         D
2013-01-01 -2.442195  0.37113 -0.149027  0.983568
2013-01-02  0.583029 -2.10822 -0.636579  0.659739
2013-01-03 -1.871060 -0.46696  0.799559  0.147385

In [14]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.583029 -2.108220 -0.636579  0.659739
2013-01-03 -1.871060 -0.466960  0.799559  0.147385
2013-01-04 -0.942194 -0.596517 -1.060994  0.272827

In [15]:
df.loc[:, ["A","B"]]

                   A         B
2013-01-01 -2.442195  0.371130
2013-01-02  0.583029 -2.108220
2013-01-03 -1.871060 -0.466960
2013-01-04 -0.942194 -0.596517
2013-01-05  0.210414  3.137729
2013-01-06 -0.930304  0.801157

In [16]:
df.loc["20130102":"20130104", ["A","B"]]

                   A         B
2013-01-02  0.583029 -2.108220
2013-01-03 -1.871060 -0.466960
2013-01-04 -0.942194 -0.596517

In [17]:
df.iloc[3]

A   -0.942194
B   -0.596517
C   -1.060994
D    0.272827
Name: 2013-01-04 00:00:00, dtype: float64

In [18]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.942194 -0.596517
2013-01-05  0.210414  3.137729

In [19]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.583029 -0.636579
2013-01-03 -1.871060  0.799559
2013-01-05  0.210414  0.680962

In [20]:
df.head(6)

                   A         B         C         D
2013-01-01 -2.442195  0.371130 -0.149027  0.983568
2013-01-02  0.583029 -2.108220 -0.636579  0.659739
2013-01-03 -1.871060 -0.466960  0.799559  0.147385
2013-01-04 -0.942194 -0.596517 -1.060994  0.272827
2013-01-05  0.210414  3.137729  0.680962 -0.920845
2013-01-06 -0.930304  0.801157 -2.671204 -0.874440

In [21]:
df[df["A"]>0]

                   A         B         C         D
2013-01-02  0.583029 -2.108220 -0.636579  0.659739
2013-01-05  0.210414  3.137729  0.680962 -0.920845

In [22]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN  0.371130       NaN  0.983568
2013-01-02  0.583029       NaN       NaN  0.659739
2013-01-03       NaN       NaN  0.799559  0.147385
2013-01-04       NaN       NaN       NaN  0.272827
2013-01-05  0.210414  3.137729  0.680962       NaN
2013-01-06       NaN  0.801157       NaN       NaN

In [23]:
df.head(6)

                   A         B         C         D
2013-01-01 -2.442195  0.371130 -0.149027  0.983568
2013-01-02  0.583029 -2.108220 -0.636579  0.659739
2013-01-03 -1.871060 -0.466960  0.799559  0.147385
2013-01-04 -0.942194 -0.596517 -1.060994  0.272827
2013-01-05  0.210414  3.137729  0.680962 -0.920845
2013-01-06 -0.930304  0.801157 -2.671204 -0.874440

In [24]:
df["E"] = ["one", "one", "two", "three", "four", "three"]
df

                   A         B         C         D      E
2013-01-01 -2.442195  0.371130 -0.149027  0.983568    one
2013-01-02  0.583029 -2.108220 -0.636579  0.659739    one
2013-01-03 -1.871060 -0.466960  0.799559  0.147385    two
2013-01-04 -0.942194 -0.596517 -1.060994  0.272827  three
2013-01-05  0.210414  3.137729  0.680962 -0.920845   four
2013-01-06 -0.930304  0.801157 -2.671204 -0.874440  three

In [25]:
df["E"].isin(["two","four"])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [26]:
df[df["E"].isin(["two","four"])]

                   A         B         C         D     E
2013-01-03 -1.871060 -0.466960  0.799559  0.147385   two
2013-01-05  0.210414  3.137729  0.680962 -0.920845  four

In [27]:
del df["E"]
df

                   A         B         C         D
2013-01-01 -2.442195  0.371130 -0.149027  0.983568
2013-01-02  0.583029 -2.108220 -0.636579  0.659739
2013-01-03 -1.871060 -0.466960  0.799559  0.147385
2013-01-04 -0.942194 -0.596517 -1.060994  0.272827
2013-01-05  0.210414  3.137729  0.680962 -0.920845
2013-01-06 -0.930304  0.801157 -2.671204 -0.874440

In [28]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -2.442195  0.371130 -0.149027  0.983568
2013-01-02 -1.859166 -1.737090 -0.785606  1.643307
2013-01-03 -3.730226 -2.204050  0.013953  1.790692
2013-01-04 -4.672419 -2.800568 -1.047041  2.063518
2013-01-05 -4.462005  0.337161 -0.366079  1.142674
2013-01-06 -5.392309  1.138318 -3.037283  0.268234